aperezceit/sensor_node/CheckDataRateLora/CC3220SF_STARPORTS.c
/*
 *  =============================== GPIO ===============================
 */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOCC32XX.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC3220SF_STARPORTS.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array.  Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {

    GPIOCC32XX_GPIO_30 | GPIO_DO_NOT_CONFIG, /* RN2483 /MCLR  */

    /* STARPORTS GPIO Pins */
    GPIOCC32XX_GPIO_12 | GPIO_DO_NOT_CONFIG, /* ADXL355_CS */
    GPIOCC32XX_GPIO_13 | GPIO_DO_NOT_CONFIG, /* BME280_CS */
    GPIOCC32XX_GPIO_22 | GPIO_DO_NOT_CONFIG, /* LDC1000_CS */
    GPIOCC32XX_GPIO_08 | GPIO_DO_NOT_CONFIG, /* EN_NODE */
    GPIOCC32XX_GPIO_06 | GPIO_DO_NOT_CONFIG, /* EN_ADXL355 */
    GPIOCC32XX_GPIO_00 | GPIO_DO_NOT_CONFIG, /* EN_BME280 */
    GPIOCC32XX_GPIO_28 | GPIO_DO_NOT_CONFIG, /* EN_LDC1000 */
    GPIOCC32XX_GPIO_07 | GPIO_DO_NOT_CONFIG, /* DS1374_INTB */
    GPIOCC32XX_GPIO_10 | GPIO_DO_NOT_CONFIG, /* SCL */
    GPIOCC32XX_GPIO_11 | GPIO_DO_NOT_CONFIG, /* SDA */
    GPIOCC32XX_GPIO_14 | GPIO_DO_NOT_CONFIG, /* SCLK */
    GPIOCC32XX_GPIO_16 | GPIO_DO_NOT_CONFIG, /* MOSI */
    GPIOCC32XX_GPIO_17 | GPIO_DO_NOT_CONFIG, /* CS */

};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC3220SF_STARPORTS.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    NULL,  /* CC3220SF_STARPORTS_GPIO_SW2 */
    NULL,  /* CC3220SF_STARPORTS_GPIO_SW3 */
    NULL,  /* CC3220SF_STARPORTS_SPI_MASTER_READY */
    NULL   /* CC3220SF_STARPORTS_SPI_SLAVE_READY */
};

/* The device-specific GPIO_config structure */
const GPIOCC32XX_Config GPIOCC32XX_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = (~0)
};


/*  =============================== I2C ===============================
 */
#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CCC32XX.h>

I2CCC32XX_Object i2cCC3220SObjects[CC3220SF_STARPORTS_I2CCOUNT];

const I2CCC32XX_HWAttrsV1 i2cCC3220SHWAttrs[CC3220SF_STARPORTS_I2CCOUNT] = {
    {
        .baseAddr = I2CA0_BASE,
        .intNum = INT_I2CA0,
        .intPriority = (~0),
        .clkPin = I2CCC32XX_PIN_01_I2C_SCL,
        .dataPin = I2CCC32XX_PIN_02_I2C_SDA
    }
};

const I2C_Config I2C_config[CC3220SF_STARPORTS_I2CCOUNT] = {
    {
        .fxnTablePtr = &I2CCC32XX_fxnTable,
        .object = &i2cCC3220SObjects[CC3220SF_STARPORTS_I2C0],
        .hwAttrs = &i2cCC3220SHWAttrs[CC3220SF_STARPORTS_I2C0]
    }
};

const uint_least8_t I2C_count = CC3220SF_STARPORTS_I2CCOUNT;

/*
 *  =============================== Power ===============================
 */
/*
 * This table defines the parking state to be set for each parkable pin
 * during LPDS. (Device pins must be parked during LPDS to achieve maximum
 * power savings.)  If the pin should be left unparked, specify the state
 * PowerCC32XX_DONT_PARK.  For example, for a UART TX pin, the device
 * will automatically park the pin in a high state during transition to LPDS,
 * so the Power Manager does not need to explictly park the pin.  So the
 * corresponding entries in this table should indicate PowerCC32XX_DONT_PARK.
 */
PowerCC32XX_ParkInfo parkInfo[] = {
/*          PIN                    PARK STATE              PIN ALIAS (FUNCTION)
     -----------------  ------------------------------     -------------------- */
    {PowerCC32XX_PIN01, PowerCC32XX_DRIVE_LOW},   /* I2C_SCL             */
    {PowerCC32XX_PIN02, PowerCC32XX_DRIVE_LOW},   /* I2C_SDA             */
    {PowerCC32XX_PIN03, PowerCC32XX_DRIVE_LOW},   /* SPI_CS_ADXL355      */
    {PowerCC32XX_PIN04, PowerCC32XX_DRIVE_LOW},   /* SPI_CS_BME280       */
    {PowerCC32XX_PIN05, PowerCC32XX_DRIVE_LOW},   /* SPI_SCLK            */
    {PowerCC32XX_PIN06, PowerCC32XX_DRIVE_LOW},   /* SPI_MISO            */
    {PowerCC32XX_PIN07, PowerCC32XX_DRIVE_LOW},   /* SPI_MOSI            */
    {PowerCC32XX_PIN08, PowerCC32XX_DRIVE_LOW},   /* SPI_CS              */
    {PowerCC32XX_PIN13, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* FLASH_SPI_DIN       */
    {PowerCC32XX_PIN15, PowerCC32XX_DRIVE_LOW}, /* SPI_CS_LDC1000      */
    {PowerCC32XX_PIN16, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* TDI (JTAG DEBUG)    */
    {PowerCC32XX_PIN17, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* TDO (JTAG DEBUG)    */
    {PowerCC32XX_PIN19, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* TCK (JTAG DEBUG)    */
    {PowerCC32XX_PIN20, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* TMS (JTAG DEBUG)    */
    {PowerCC32XX_PIN18, PowerCC32XX_DRIVE_LOW}, /* EN_LDC1000          */
    {PowerCC32XX_PIN21, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* SOP2                */
    {PowerCC32XX_PIN29, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* ANTSEL1             */
    {PowerCC32XX_PIN30, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* ANTSEL2             */
    {PowerCC32XX_PIN45, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* DCDC_ANA2_SW_P      */
    {PowerCC32XX_PIN50, PowerCC32XX_DRIVE_LOW}, /* EN_BME280           */
    {PowerCC32XX_PIN52, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* RTC_XTAL_N          */
    {PowerCC32XX_PIN53, PowerCC32XX_DRIVE_LOW}, /* RN2483_MCLR         */
    {PowerCC32XX_PIN55, PowerCC32XX_DRIVE_LOW},   /* XDS_UART_RX         */
    {PowerCC32XX_PIN57, PowerCC32XX_DRIVE_LOW},   /* XDS_UART_TX         */
    {PowerCC32XX_PIN58, PowerCC32XX_DRIVE_LOW},   /* UART_TX             */
    {PowerCC32XX_PIN59, PowerCC32XX_DRIVE_LOW},   /* UART_RX             */
    {PowerCC32XX_PIN60, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* ADCIN               */
    {PowerCC32XX_PIN61, PowerCC32XX_DRIVE_LOW}, /* EN_ADXL355          */
    {PowerCC32XX_PIN62, PowerCC32XX_WEAK_PULL_DOWN_STD}, /* INTB_RTC            */
    {PowerCC32XX_PIN63, PowerCC32XX_DRIVE_LOW},   /* EN_NODE             */
    {PowerCC32XX_PIN64, PowerCC32XX_DRIVE_LOW}, /* LDC1000_CLK         */
};

